tap "ggpeti/rmrec"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "roots/tap"
tap "universal-ctags/universal-ctags"
brew "automake"
brew "bash"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "pcre"
brew "python@3.9"
brew "cairo"
brew "cmake"
brew "cmatrix"
brew "e2fsprogs"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "python@3.10"
brew "gobject-introspection"
brew "libbluray"
brew "srt"
brew "ffmpeg"
brew "git"
brew "git-flow-avh"
brew "gnu-sed"
brew "grep"
brew "irssi"
brew "lftp"
brew "media-info"
brew "neofetch"
brew "perl"
brew "php"
brew "pure"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rename"
brew "rsync"
brew "telnet"
brew "the_silver_searcher"
brew "trash"
brew "tree"
brew "vim"
brew "volta"
brew "youtube-dl"
brew "yt-dlp"
brew "zsh"
brew "zsh-completions"
brew "roots/tap/trellis-cli"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "adobe-creative-cloud"
cask "blackhole-16ch"
cask "figma"
cask "firefox-developer-edition"
cask "fontplop"
cask "gdlauncher"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "microsoft-auto-update"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "mos"
cask "obs"
cask "obsidian"
cask "parallels"
cask "sequel-ace"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "steelseries-exactmouse-tool"
cask "the-unarchiver"
cask "transmit"
cask "vagrant"
cask "visual-studio-code"
cask "zoom"
