automake
cmake
composer
ffmpeg
git
git-flow-avh
gnu-sed
grep
irssi
neofetch
nvm
pkg-config
rename
rmtrash
rsync
the_silver_searcher
tree
universal-ctags/universal-ctags/universal-ctags
vim
zsh
zsh-completions
