automake
bower
cmake
composer
ffmpeg
git
git-flow-avh
grunt-cli
irssi
neofetch
node@10
pkg-config
python@2
rename
rmtrash
rsync
the_silver_searcher
tree
universal-ctags/universal-ctags/universal-ctags
vim
yarn
zsh
zsh-completions
