tap "ggpeti/rmrec"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "roots/tap"
tap "shivammathur/php"
tap "universal-ctags/universal-ctags"
brew "automake"
brew "bash"
brew "gettext"
brew "glib"
brew "cairo"
brew "cmake"
brew "cmatrix"
brew "icu4c@76"
brew "php"
brew "composer"
brew "e2fsprogs"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "python@3.12"
brew "libbluray"
brew "srt"
brew "ffmpeg"
brew "git"
brew "git-flow"
brew "gnu-sed"
brew "pkgconf"
brew "gobject-introspection"
brew "graphviz"
brew "grep"
brew "irssi"
brew "lftp"
brew "lima"
brew "media-info"
brew "mtr"
brew "pcre"
brew "perl"
brew "pure"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python-tk@3.12"
brew "python@3.10"
brew "python@3.9"
brew "rename"
brew "rsync"
brew "telnet"
brew "the_silver_searcher"
brew "trash", link: true
brew "tree"
brew "vim"
brew "volta"
brew "wget"
brew "yt-dlp"
brew "zsh"
brew "zsh-completions"
brew "roots/tap/trellis-cli"
cask "1password"
cask "adobe-creative-cloud"
cask "alt-tab"
cask "blackhole-16ch"
cask "devkinsta"
cask "discord"
cask "docker"
cask "figma"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "iterm2"
cask "linearmouse"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "obs"
cask "obsidian"
cask "parallels"
cask "prismlauncher"
cask "rectangle"
cask "sequel-ace"
cask "slack"
cask "steam"
cask "the-unarchiver"
cask "transmit"
cask "visual-studio-code"
cask "zoom"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cjhowe7.laravel-blade"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-vscode.live-server"
vscode "pepri.subtitles-editor"
vscode "pkief.material-icon-theme"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xdebug.php-debug"
vscode "yogensia.searchwpdocs"
vscode "zhuangtongfa.material-theme"
